app/controllers/articles_controller.rb

  def update
    set_article.update(title: params[:article][:title], description: params[:article][:description])
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2020-03-06 23:12:51.771903"], ["id", 1]]